Repository: Daniel-KM/Omeka-S-module-Sparql
Catalog: language/*.po
Languages: fr

source: The module %1$s should be upgraded to version %2$s or later.
fr: Le module « %1$s » doit être mis à niveau à la version « %2$s » ou supérieure.

source: The module requires php version {version} or newer, but your server has version {version_php}.
fr: Le module nécessité la version php {version} ou plus récent, mais votre serveur a la version {version_php}.

source: Namespaces
fr: Espaces de noms

source: Results
fr: Résultats

source: The RDF triplestore is not available currently.
fr: Le triplestore RDF n’est pas disponible actuellement.

source: The setting "heading" was removed from block Sparql. New blocks "Heading" or "Html" were prepended to all blocks that had a filled heading. You may check pages for styles: {json}
fr: Le paramètres "en-tête" a été supprimé du bloc Sparql. Un bloc En-tête ou Html a été ajouté pour tous les blocs qui avait une en-tête. Vous pouvez vérifier les pages pour les styles : {json}

source: The setting "template" was moved to the new block layout settings available since Omeka S v4.1. You may check pages for styles: {json}
fr: Le paramètre « template » a été déplacé dans les nouveaux paramètres de bloc depuis Omeka S v4.1. Vous pouvez vérifier les pages pour les styles : {json}

source: The template files for the block Sparql should be moved from "view/common/block-layout" to "view/common/block-template" in your themes. You may check your themes for pages: {json}
fr: Les fichiers de modèle pour le bloc Sparql doivent être déplacés de view/common/block-layout à view/common/block-template dans vos thèmes. Vous pouvez vérifier vos thèmes pour les pages : {json}

source: Don’t forget to index resources regularly via the button "Process" in the {link}config form{link_end}.
fr: N’oubliez pas d’indexer les ressources régulièrement via le bouton "Traiter" dans le {link}formulaire de config{link_end}.

source: The directory "{directory}" is not writeable.
fr: Le répertoire « {directory} » n’est pas accessible en écriture.

source: The module DataTypeGeometry should be at least version 3.4.4 to index geographic and geometric values.
fr: Le module Data Type Geometry doit être au moins à la version 3.4.4 pour indexer les valeurs géographiques et géométriques.

source: You should index your data first for the internal sparql server or for an external one. The internal one is available at {link} and a form can be anywhere via the site page block "sparql".
fr: Vous devez d’abord indexer vos données pour le serveur sparql interne ou pour un serveur externe. Le serveur interne est disponible à {link} et un formulaire peut être mis partout dans le site via le bloc de page « sparql ».

source: The data types html and xml are currently not supported and converted into literal.
fr: Les types de données html et xml ne sont actuellement pas pris en charge et convertis en données littérales.

source: Indexing json-ld triplestore in background ({link_job}job #{job_id}{link_end}, {link_log}logs{link_end}).
fr: Indexation du triplestore json-ld en tâche de fond ({link_job}job #{job_id}{link_end}, {link_log}logs{link_end}).

source: Sparql dataset "{dataset}": it is useless to index fuseki by resource and by file at the same time. The latter is skipped.
fr: Jeu de données Sparql « {dataset} » : il est inutile d’indexer fuseki par ressource et par fichier en même temps. Ce dernier mode est ignoré.

source: Sparql dataset "{dataset}": no index defined. Existing indexes are kept.
fr: Jeu de données Sparql « {dataset} » : aucun index n’est défini. Les index existants sont conservés.

source: Sparql dataset "{dataset}": indexing formats: {formats}.
fr: Jeu de données Sparql « {dataset} » : indexation des formats : {formats}.

source: Sparql dataset "{dataset}": end of indexing. {total} resources indexed ({total_errors} errors). Execution time: {duration} seconds.
fr: Jeu de données Sparql « {dataset} » : fin de l’indexation. {total} ressources indexées ({total_errors} erreurs). Temps d’exécution : {duration} secondes.

source: Sparql dataset "{dataset}": skipped formats: {formats}.
fr: Jeu de données Sparql « {dataset} » : formats ignorés : {formats}.

source: Sparql dataset "{dataset}": Medias cannot be indexed without indexing items.
fr: Jeu de données Sparql « {dataset} » : les médias ne peuvent pas être indexés sans indexer les contenus.

source: Sparql dataset "{dataset}" ({format}): {message}
fr: Jeu de données Sparql « {dataset} » ({format}) : {message}

source: Sparql dataset "{dataset}" ({format}): A sparql endpoint is required to index resources in Fuseki.
fr: Jeu de données Sparql « {dataset} » ({format}) : un point d’accès sparql est nécessaire pour indexer les ressources dans Fuseki.

source: Sparql dataset "{dataset}" ({format}): A authentication mode is set, but no user name/password.
fr: Jeu de données Sparql « {dataset} » ({format}) : un mode d’authentification est défini, mais aucun utilisateur ni mot de passe.

source: Sparql dataset "{dataset}" ({format}): the endpoint is not available: {message}
fr: Jeu de données Sparql « {dataset} » ({format}) : le point d’accès est indisponible : {message}

source: Sparql dataset "{dataset}" ({format}): the dataset cannot be deleted: {message}
fr: Jeu de données Sparql « {dataset} » ({format}) : le jeu de données ne peut pas être supprimé : {message}

source: Sparql dataset "{dataset}" ({format}): the dataset cannot be created: {message}
fr: Jeu de données Sparql « {dataset} » ({format}) : le jeu de données ne peut pas être créé : {message}

source: Sparql dataset "{dataset}" ({format}): output is invalid.
fr: Jeu de données Sparql « {dataset} » ({format}) : sortie incorrecte.

source: Sparql dataset "{dataset}" ({format}): the dataset cannot be activated: {message}
fr: Jeu de données Sparql « {dataset} » ({format}) : le jeu de données ne peut pas être activé : {message}

source: Sparql dataset "{dataset}": indexing {total} item sets.
fr: Jeu de données Sparql « {dataset} » : indexation de {total} collections.

source: Sparql dataset "{dataset}": The job was stopped. Indexed {count}/{total} item sets.
fr: Jeu de données Sparql « {dataset} » : tâche arrêtée ; {count}/{total} collections indexées.

source: Sparql dataset "{dataset}": indexed {count}/{total} item sets.
fr: Jeu de données Sparql « {dataset} » : {count}/{total} collections indexées.

source: Sparql dataset "{dataset}": indexing {total} items and attached medias.
fr: Jeu de données Sparql « {dataset} » : indexation de {total} contenus et médias attachés.

source: Sparql dataset "{dataset}": indexing {total} items.
fr: Jeu de données Sparql « {dataset} » : indexation de {total} contenus.

source: Sparql dataset "{dataset}": The job was stopped. Indexed {count}/{total} items.
fr: Jeu de données Sparql « {dataset} » : tâche arrêtée ; {count}/{total} contenus indexés.

source: Sparql dataset "{dataset}": indexed {count}/{total} items.
fr: Jeu de données Sparql « {dataset} » : {count}/{total} contenus indexés.

source: Sparql dataset "{dataset}", {resource_type} #{resource_id}: {message}
fr: Jeu de données Sparql « {dataset} », {resource_type} #{resource_id} : {message}

source: Sparql dataset "{dataset}" ({format}), {resource_type} #{resource_id}: {message}
fr: Jeu de données Sparql « {dataset} » ({format}), {resource_type} #{resource_id} : {message}

source: Sparql dataset "{dataset}" ({format}), {resource_type} #{resource_id}: no triples.
fr: Jeu de données Sparql « {dataset} » ({format}), {resource_type} #{resource_id} : pas de triplets.

source: Sparql dataset "{dataset}" ({format}): a triplestore file is required to index fuseki from file.
fr: Jeu de données Sparql « {dataset} » ({format}) : un fichier de triplestore est nécessaire pour indexer Fuseki depuis un fichier.

source: Sparql dataset "{dataset}" ({format}): the triplestore file required to index fuseki is empty.
fr: Jeu de données Sparql « {dataset} » ({format}) : le fichier triplestore nécessaire pour indexer Fuseki est vide.

source: Sparql dataset "{dataset}" ({format}), {resource_type} #{resource_id}: unable to store data.
fr: Jeu de données Sparql « {dataset} » ({format}), {resource_type} #{resource_id} : impossible d’enregistrer les données.

source: Limit indexation to specific resources
fr: Limiter l’indexation à des types de ressources

source: Medias
fr: Médias

source: Limit indexation of items with a query
fr: Limiter l’indexation des contenus avec une requête

source: Output private resources and values
fr: Publier les ressources et valeurs privées

source: Omeka metadata to include
fr: Métadonnées Omeka à inclure

source: Title as rdf label
fr: Titre en tant que label rdf

source: Limit indexation to specific properties
fr: Limiter l’indexation à des propriétés

source: Select properties…
fr: Choisir des propriétés…

source: Skip indexation for specific properties
fr: Ignorer l’indexation pour des propriétés

source: Limit indexation to specific data types
fr: Limiter l’indexation à des types de données

source: Skip indexation for specific data types
fr: Ignorer l’indexation pour des types de données

source: Write access key for Arc2 (random)
fr: Clé d’accès en écriture pour Arc2 (aléatoire)

source: Fuseki endpoint
fr: Fuseki : point d’accès

source: Fuseki authentication mode
fr: Fuseki : mode d’authentification

source: Fuseki username
fr: Fuseki : utilisateur

source: Fuseki password
fr: Fuseki : mot de passe

source: Index in sparql engine
fr: Indexer dans le moteur sparql

source: Internal database (used for the internal sparql endpoint)
fr: Base de données interne (utilisée pour le point d’accès sparql interne)

source: Fuseki (by resource)
fr: Fuseki (par ressource)

source: Fuseki (in bulk via file)
fr: Fuseki (en lot via le fichier)

source: Triplestore (turtle file, used to index in bulk any third party sparql server)
fr: Triplestore (fichier turtle, utilisé pour indexer en lot un serveur sparql tiers)

source: Process
fr: Traitement

source: Endpoint
fr: Point d’accès

source: When using yasgui, clear the cache of the browser after modifying these options.
fr: Lorsque yasgui est utilisé, le cache du navigateur doit être réinitialisé après modification de ces options.

source: Automatic (external if any, else internal if any)
fr: Automatique (externe si présent, sinon interne si présent)

source: Internal (/sparql)
fr: Interne (/sparql)

source: External (set below)
fr: Externe (défini ci-dessous)

source: Internal and external (set below)
fr: Interne et externe (défini ci-dessous)

source: External endpoint
fr: Point d’accès externe

source: When Fuseki is installed locally, the url to index may be "http://localhost/sparql" and the external endpoint may be "http://example.org/sparql/triplestore".
fr: Lorsque Fuseki est installé en local, l’url pour indexer peut être « http://localhost/sparql » et le point d’accès externe peut être « http://example.org/sparql/triplestore ».

source: Max results per page (internal endpoint)
fr: Nombre maximum de résultats par page (point d’accès interne)

source: Simple (internal engine)
fr: Simple (moteur interne)

source: Prepend prefixes
fr: Ajouter les préfixes
